//Variable for products page
export const productsData = [
  {
    id: 1,
    image: require("./src/assets/images/shoes1.png"),
    title: "حذاء رياضي ( اديداس )",
  },
  {
    id: 2,
    image: require("./src/assets/images/shoes2.png"),
    title: "اير ماكس ( نايك )",
  },

  {
    id: 3,
    image: require("./src/assets/images/shoes3.png"),
    title: "نظارة شمس",
  },

  {
    id: 4,
    image: require("./src/assets/images/shoes4.png"),
    title: "حذاء رياضي ( اديداس )",
  },

  {
    id: 5,
    image: require("./src/assets/images/shoes5.png"),
    title: "حذاء رياضي ( اديداس )",
  },

  {
    id: 6,
    image: require("./src/assets/images/shoes6.png"),
    title: "حذاء رياضي ( اديداس )",
  },
  {
    id: 7,
    image: require("./src/assets/images/shoes7.png"),
    title: "حذاء رياضي ( اديداس )",
  },
  {
    id: 8,
    image: require("./src/assets/images/shoes8.png"),
    title: "حذاء رياضي ( اديداس )",
  },
  {
    id: 9,
    image: require("./src/assets/images/shoes9.png"),
    title: "حذاء رياضي ( اديداس )",
  },
  {
    id: 10,
    image: require("./src/assets/images/shoes10.png"),
    title: "حذاء رياضي ( اديداس )",
  },
  {
    id: 11,
    image: require("./src/assets/images/shoes11.png"),
    title: "اير ماكس ( نايك )",
  },
  {
    id: 12,
    image: require("./src/assets/images/shoes12.png"),
    title: "اير ماكس ( نايك )",
  },
];

//variable for categories
export const categoriesData = [
  {
    id: 1,
    image: require("./src/assets/images/shoes1.png"),
    title: "حذاء رياضي ( اديداس )",
  },
  {
    id: 2,
    image: require("./src/assets/images/shoes2.png"),
    title: "اير ماكس ( نايك )",
  },

  {
    id: 3,
    image: require("./src/assets/images/shoes3.png"),
    title: "نظارة شمس",
  },

  {
    id: 4,
    image: require("./src/assets/images/shoes4.png"),
    title: "حذاء رياضي ( اديداس )",
  },

  {
    id: 5,
    image: require("./src/assets/images/shoes5.png"),
    title: "حذاء رياضي ( اديداس )",
  },

  {
    id: 6,
    image: require("./src/assets/images/shoes6.png"),
    title: "حذاء رياضي ( اديداس )",
  }
];

//Variable for products in index page
export const productsSection = [
  {
    id: 1,
    image: require("./src/assets/images/shoes1.png"),
    title: "اير ماكس ( نايك )",
  },
  {
    id: 2,
    image: require("./src/assets/images/shoes2.png"),
    title: "حذاء رياضي ( اديداس )",
  },

  {
    id: 3,
    image: require("./src/assets/images/shoes3.png"),
    title: "اير ماكس ( نايك )",
  },

  {
    id: 4,
    image: require("./src/assets/images/shoes4.png"),
    title: "اير ماكس ( نايك )",
  },
];

//variable for blog swiper
export const blogswiper = [
  {
    id: 1,
    image: require("./src/assets/images/blog1.png"),
    userName: "Ahmed",
    title: "أفضل عروض النظارات",
    description:
      "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم، ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص. إن كنت تريد أن تستخدم نص لوريم إيبسوم ما، عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة",
  },

  {
    id: 2,
    image: require("./src/assets/images/blog2.png"),
    userName: "Sally",
    title: "تخفيضات جديدة",
    description:
      "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم، ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص. إن كنت تريد أن تستخدم نص لوريم إيبسوم ما، عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة",
  },

  {
    id: 3,
    image: require("./src/assets/images/blog3.png"),
    userName: "Aliaa",
    title: "موديلات جديدة ",
    description:
      "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم، ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص. إن كنت تريد أن تستخدم نص لوريم إيبسوم ما، عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة",
  },

  {
    id: 4,
    image: require("./src/assets/images/blog4.png"),
    userName: "Kareem",
    title: "أفضل عروض النظارات",
    description:
      "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم، ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص. إن كنت تريد أن تستخدم نص لوريم إيبسوم ما، عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة",
  },
];

//variable for blog page
export const blogData = [
  {
    id: 1,
    image: require("./src/assets/images/blog1.png"),
    userName: "Ahmed",
    title: "أفضل عروض النظارات",
    description:
      "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم، ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص. إن كنت تريد أن تستخدم نص لوريم إيبسوم ما، عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة",
  },

  {
    id: 2,
    image: require("./src/assets/images/blog2.png"),
    userName: "Sally",
    title: "تخفيضات جديدة",
    description:
      "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم، ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص. إن كنت تريد أن تستخدم نص لوريم إيبسوم ما، عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة",
  },

  {
    id: 3,
    image: require("./src/assets/images/blog3.png"),
    userName: "Aliaa",
    title: "موديلات جديدة ",
    description:
      "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم، ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص. إن كنت تريد أن تستخدم نص لوريم إيبسوم ما، عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة",
  },

  {
    id: 4,
    image: require("./src/assets/images/blog4.png"),
    userName: "Kareem",
    title: "أفضل عروض النظارات",
    description:
      "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم، ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص. إن كنت تريد أن تستخدم نص لوريم إيبسوم ما، عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة",
  },

  {
    id: 5,
    image: require("./src/assets/images/blog5.png"),
    userName: "Amir",
    title: "أفضل عروض النظارات",
    description:
      "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم، ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص. إن كنت تريد أن تستخدم نص لوريم إيبسوم ما، عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة",
  },

  {
    id: 6,
    image: require("./src/assets/images/blog6.png"),
    userName: "Hany",
    title: "أفضل عروض النظارات",
    description:
      "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم، ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص. إن كنت تريد أن تستخدم نص لوريم إيبسوم ما، عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة",
  },

  {
    id: 7,
    image: require("./src/assets/images/blog7.png"),
    userName: "Ali",
    title: "اهم ماركات النظارات",
    description:
      "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم، ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص. إن كنت تريد أن تستخدم نص لوريم إيبسوم ما، عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة",
  },

  {
    id: 8,
    image: require("./src/assets/images/blog8.png"),
    userName: "Hadeer",
    title: "أفضل عروض النظارات",
    description:
      "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم، ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص. إن كنت تريد أن تستخدم نص لوريم إيبسوم ما، عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة",
  },

  {
    id: 9,
    image: require("./src/assets/images/blog9.png"),
    userName: "Alexa",
    title: "أفضل عروض النظارات",
    description:
      "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم، ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص. إن كنت تريد أن تستخدم نص لوريم إيبسوم ما، عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة",
  },

  {
    id: 10,
    image: require("./src/assets/images/blog10.png"),
    userName: "Ahmed",
    title: "أفضل عروض النظارات",
    description:
      "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم، ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص. إن كنت تريد أن تستخدم نص لوريم إيبسوم ما، عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة",
  },

  {
    id: 11,
    image: require("./src/assets/images/blog11.png"),
    userName: "Bassant",
    title: "أفضل عروض النظارات",
    description:
      "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم، ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص. إن كنت تريد أن تستخدم نص لوريم إيبسوم ما، عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة",
  },

  {
    id: 12,
    image: require("./src/assets/images/blog12.png"),
    userName: "Alaa",
    title: "أحدث صيحات الموضة",
    description:
      "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم، ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص. إن كنت تريد أن تستخدم نص لوريم إيبسوم ما، عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة",
  },
];

//variable for trends blogs
export const trendsBlogs = [
  {
    id: 1,
    image: require("./src/assets/images/blog1.png"),
    userName: "Ahmed",
    title: "أفضل عروض النظارات",
    description:
      "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم، ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص. إن كنت تريد أن تستخدم نص لوريم إيبسوم ما، عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة",
  },

  {
    id: 2,
    image: require("./src/assets/images/blog2.png"),
    userName: "Sally",
    title: "تخفيضات جديدة",
    description:
      "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم، ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص. إن كنت تريد أن تستخدم نص لوريم إيبسوم ما، عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة",
  },

  {
    id: 3,
    image: require("./src/assets/images/blog3.png"),
    userName: "Aliaa",
    title: "موديلات جديدة ",
    description:
      "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم، ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص. إن كنت تريد أن تستخدم نص لوريم إيبسوم ما، عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة",
  },

  {
    id: 4,
    image: require("./src/assets/images/blog4.png"),
    userName: "Kareem",
    title: "أفضل عروض النظارات",
    description:
      "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم، ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص. إن كنت تريد أن تستخدم نص لوريم إيبسوم ما، عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة",
  },
];
