import style from "./styles/Rules.module.scss";

const RulesComponent = () => {
  return (
    <>
      <section className={style.rulesSection}>
        <div className="container">
          <div className="rule-unit">
            <h4>مقدمة عن الشروط والاحكام</h4>
            <p>
              هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد
              هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو
              العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها
              التطبيق. إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص
              العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي
              أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص،
              حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم
              الموقع. ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم
              ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم
              عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم
              فيظهر بشكل لا يليق.
            </p>
          </div>

          <div className="rule-unit">
            <h4>كيف نستخدم معلوماتك</h4>
            <ul>
              <li>نستخدم المعلومات التي نجمعها بطرق مختلفة ، بما في ذلك:</li>
              <li>توفير وتشغيل وصيانة موقعنا</li>
              <li>تحسين وتخصيص وتوسيع موقعنا</li>
              <li>فهم وتحليل كيفية استخدامك لموقعنا</li>
              <li>تطوير منتجات وخدمات وميزات ووظائف جديدة</li>
              <li>
                التواصل معك ، إما بشكل مباشر أو من خلال أحد شركائنا ، بما في ذلك
                لخدمة العملاء ، لتزويدك بالتحديثات والمعلومات الأخرى المتعلقة
                بالموقع ولأغراض تسويقية وترويجية
              </li>
              <li>أرسل لك رسائل البريد الإلكتروني</li>
              <li>البحث عن ومنع الاحتيال</li>
            </ul>
          </div>

          <div className="rule-unit">
            <h4>ملفات الدخول</h4>
            <p>
              هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد
              هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو
              العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها
              التطبيق. إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص
              العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي
              أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص،
              حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم
              الموقع. ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم
              ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم
              عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم
              فيظهر بشكل لا يليق.
            </p>
          </div>
        </div>
      </section>
    </>
  );
};

export default RulesComponent;
